app/controllers/short_urls_controller.rb

  def create
    @url = ShortUrl.create!(short_url_params)
---
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://www.test.rspec', '2022-01-22 11:21:30.906199', '2022-01-22 11:21:30.906199')

  def show
    code = params[:id]
    @url = ShortUrl.find_by_short_code(code)
    @url.increment_click_count!
---
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-01-22 13:06:49.322219' WHERE `short_urls`.`id` = 70